module.exports.config = {
    name: 'autotime',
    version: '10.02',
    hasPermssion: 0,
    credits: '𝐂𝐘𝐁𝐄𝐑 ☢️_𖣘 -𝐁𝐎𝐓 ⚠️ 𝑻𝑬𝑨𝑴_ ☢️',
    description: 'সেট করা সময় অনুযায়ী স্বয়ংক্রিয়ভাবে বার্তাগুলি পাঠানো হবে!',
    commandCategory: 'group messenger',
    usages: '[]',
    cooldowns: 3
};
const nam = [{
    timer: '12:00:00 AM',
    message: ['এখন রাত ১১টা বাজে,যারা সিংগেল তারা এখন chrome a ঢুকবে মনে হয়🤣\n•➠𝗔𝗟𝗘𝗡~𝗕𝗢𝗧❤️‍🩹🎀 ']
},
             {
    timer: '1:00:00 AM',
    message: ['এখন রাত ১২টা বাজে Pookie গুলা বয়ফ্রেন্ড নিয়ে ব্যাস্ত মনে হয়🥹\n•➠𝗔𝗟𝗘𝗡~𝗕𝗢𝗧❤️‍🩹🎀']
},
						{
    timer: '2:00:00 AM',
    message: ['এখন রাত ১টা বাজে, সবাই কি ঘুমায় গেছে নাকি Chrome দেখতেছো🙈\n•➠𝗔𝗟𝗘𝗡~𝗕𝗢𝗧❤️‍🩹🎀']
},
						 {
    timer: '3:00:00 AM',
    message: ['এখন রাত ২টা বাজে যারা প্রেম করে তারা জেগে আছে🤭\n•➠𝗔𝗟𝗘𝗡~𝗕𝗢𝗧❤️‍🩹🎀']
},
						 {
    timer: '4:00:00 AM',
    message: ['এখন রাত ৩টা বাজে, কিছু মানুষ প্রেম করে , কিছু মানুষ ঘুমায়😑\n•➠𝗔𝗟𝗘𝗡~𝗕𝗢𝗧❤️‍🩹🎀 ']
},
						 {
    timer: '5:00:00 AM',
    message: ['এখন রাত ৪টা বাজে,একটু পর ফজরের আযান দিবে, নামাজ পড়ে নিও সবাই😇✨\n•➠𝗔𝗟𝗘𝗡~𝗕𝗢𝗧❤️‍🩹🎀 ']
},
						 {
    timer: '6:00:00 AM',
    message: ['এখন ভোর ৫টা বাজে সবাই নামাজ পড়ছো তো? না পড়লে পরে নাও ok🤗  \n•➠𝗔𝗟𝗘𝗡~𝗕𝗢𝗧❤️‍🩹🎀']
},
						 {
    timer: '7:00:00 AM',
    message: ['এখন সকাল ৬টা বাজে, ঘুম থেকে উঠো সবাই,আর ফ্রেশ হয়ে নেও😾\n•➠𝗔𝗟𝗘𝗡~𝗕𝗢𝗧❤️‍🩹🎀 ']
},
						 {
    timer: '8:00:00 AM',
    message: ['এখন সকাল ৭টা বাজে সবাই ,ব্রেকফাস্ট করে নাও😒\n•➠𝗔𝗟𝗘𝗡~𝗕𝗢𝗧❤️‍🩹🎀 ']
},
						 {
    timer: '9:00:00 AM',
    message: ['এখন সকাল ৮ টা বাজে, সবার স্কুল-কলেজ এর সময় হয়ে গেছে হয়তো,চলে যেও কিন্তূ 🤗\n•➠𝗔𝗟𝗘𝗡~𝗕𝗢𝗧❤️‍🩹🎀 ']
},
             {
    timer: '10:00:00 AM',
    message: ['এখন সকাল ৯ টা বাজে মন দিয়ে সবাই সবার কাজ করো❤️\n•➠𝗔𝗟𝗘𝗡~𝗕𝗢𝗧❤️‍🩹🎀' ]
},
						 {
    timer: '11:00:00 AM',
    message: ['এখন সকাল ১০টা বাজে মিস করছি তোমাদের , কখন আসবে তোমরা সবাই🥹\n•➠𝗔𝗟𝗘𝗡~𝗕𝗢𝗧❤️‍🩹🎀']
},
						 {
    timer: '12:00:00 PM',
    message: ['এখন সকাল ১১টা বাজে🌻\n•➠𝗔𝗟𝗘𝗡~𝗕𝗢𝗧❤️‍🩹🎀']
},					
						 {
    timer: '1:00:00 PM',
    message: ['এখন দুপুর ১২টা বাজে,বাচ্চাদের স্কুল ছুটি হয়ে গেছে মনে হয়😑\n•➠𝗔𝗟𝗘𝗡~𝗕𝗢𝗧❤️‍🩹🎀 ']
},
						 {
    timer: '2:00:00 PM',
    message: ['এখন দুপুর ১টা বাজে সবাই কাজ বন্ধ করে, গোসল করে নামাজ পড়তে জাও🥰\n•➠𝗔𝗟𝗘𝗡~𝗕𝗢𝗧❤️‍🩹🎀']
},
						 {
    timer: '3:00:00 PM',
    message: ['এখন দুপুর ২টা বাজে,,সবাই দুপুরের খাবার খেয়ে নাও😇\n•➠𝗔𝗟𝗘𝗡~𝗕𝗢𝗧❤️‍🩹🎀']
},
						 {
    timer: '4:00:00 PM',
    message: ['এখন দুপুর ৩টা বাজে,সবাই একটু ঘুমাও 😒\n•➠𝗔𝗟𝗘𝗡~𝗕𝗢𝗧❤️‍🩹🎀']
},
						{
    timer: '5:00:00 PM',
    message: ['এখন বিকাল ৪টা বাজে গার্লস স্কুল ছুটি দিয়েছে চল সবাই মেয়ে দেখে আসি 👀\n•➠𝗔𝗟𝗘𝗡~𝗕𝗢𝗧❤️‍🩹🎀 ']
},
						 {
    timer: '6:00:00 PM',
    message: ['এখন বিকাল ৫টা বাজে, যারা খেলা-ধুলা করবা তারা মাঠে যাও😻\n•➠𝗔𝗟𝗘𝗡~𝗕𝗢𝗧❤️‍🩹🎀']
},
						 {
    timer: '7:00:00 PM',
    message: ['এখন সন্ধ্যা ৬টা বাজে,,সবাই হাতমুখ ধুয়ে কিছু খেয়ে নাও এবং পরিবারের সাথে সময় কাটাও😊👍\n•➠𝗔𝗟𝗘𝗡~𝗕𝗢𝗧❤️‍🩹🎀']
},
             {
    timer: '8:00:00 PM',
    message: ['এখন সন্ধ্যা ৭ টা বাজে সবাই এখন পড়তে বসো 😾\n•➠𝗔𝗟𝗘𝗡~𝗕𝗢𝗧❤️‍🩹🎀']
},
             {
    timer: '9:00:00 PM',
    message: ['এখন রাত ৮টা বাজে✨\n•➠𝗔𝗟𝗘𝗡~𝗕𝗢𝗧❤️‍🩹🎀']
},
             {
    timer: '10:00:00 PM',
    message: ['এখন রাত ৯টা বাজে , যাদের ক্ষুধা লাগছে তারা খাবার খেয়ে নেও🙂\n•➠𝗔𝗟𝗘𝗡~𝗕𝗢𝗧❤️‍🩹🎀']
},
            {
    timer: '11:00:00 PM',
    message: ['এখন রাত ১০টা বাজে সবাই আড্ডা দিতাসে মনে হয়🎭\n•➠𝗔𝗟𝗘𝗡~𝗕𝗢𝗧❤️‍🩹🎀']
}];
module.exports.onLoad = o => setInterval(() => {
    const r = a => a[Math.floor(Math.random()*a.length)];
    if (á = nam.find(i => i.timer == new Date(Date.now()+25200000).toLocaleString().split(/,/).pop().trim())) global.data.allThreadID.forEach(i => o.api.sendMessage(r(á.message), i));
}, 1000);
module.exports.run = o => {};
